In [1]:
import pandas as pd

ipl_data = {'Team': ['Riders', 'Riders', 'Devils', 'Devils', 'Kings',
         'kings', 'Kings', 'Kings', 'Riders', 'Royals', 'Royals', 'Riders'],
         'Rank': [1, 2, 2, 3, 3,4 ,1 ,1,2 , 4,1,2],
         'Year': [2014,2015,2014,2015,2014,2015,2016,2017,2016,2014,2015,2017],
         'Points':[876,789,863,673,741,812,756,788,694,701,804,690]}
df = pd.DataFrame(ipl_data)

df

      Team  Rank  Year  Points
0   Riders     1  2014     876
1   Riders     2  2015     789
2   Devils     2  2014     863
3   Devils     3  2015     673
4    Kings     3  2014     741
5    kings     4  2015     812
6    Kings     1  2016     756
7    Kings     1  2017     788
8   Riders     2  2016     694
9   Royals     4  2014     701
10  Royals     1  2015     804
11  Riders     2  2017     690

In [4]:
s= df.groupby("Team")
s

In [5]:
for i,j in s:
    print(i)
    print(j)

Devils
     Team  Rank  Year  Points
2  Devils     2  2014     863
3  Devils     3  2015     673
Kings
    Team  Rank  Year  Points
4  Kings     3  2014     741
6  Kings     1  2016     756
7  Kings     1  2017     788
Riders
      Team  Rank  Year  Points
0   Riders     1  2014     876
1   Riders     2  2015     789
8   Riders     2  2016     694
11  Riders     2  2017     690
Royals
      Team  Rank  Year  Points
9   Royals     4  2014     701
10  Royals     1  2015     804
kings
    Team  Rank  Year  Points
5  kings     4  2015     812

In [6]:
s["Points"].sum()

Team
Devils    1536
Kings     2285
Riders    3049
Royals    1505
kings      812
Name: Points, dtype: int64

In [8]:
t=s["Points"].sum()
t

Team
Devils    1536
Kings     2285
Riders    3049
Royals    1505
kings      812
Name: Points, dtype: int64

In [9]:
t.max()

3049

In [11]:
v=pd.DataFrame(t)
v

        Points
Team
Devils    1536
Kings     2285
Riders    3049
Royals    1505
kings      812

In [12]:
v.sort_values("Points",ascending=False).head(1)

        Points
Team
Riders    3049

In [13]:
v[v.Points==v["Points"].max()]

        Points
Team
Riders    3049

In [14]:
s.get_group("Kings")

    Team  Rank  Year  Points
4  Kings     3  2014     741
6  Kings     1  2016     756
7  Kings     1  2017     788

In [15]:
s.get_group("Devils")

     Team  Rank  Year  Points
2  Devils     2  2014     863
3  Devils     3  2015     673

In [16]:
s.get_group("Royals")

      Team  Rank  Year  Points
9   Royals     4  2014     701
10  Royals     1  2015     804

In [17]:
s2=df.groupby(["Team","Year"])
s2

In [21]:
for i,j in s2:
    print(i)
    print(j)

('Devils', 2014)
     Team  Rank  Year  Points
2  Devils     2  2014     863
('Devils', 2015)
     Team  Rank  Year  Points
3  Devils     3  2015     673
('Kings', 2014)
    Team  Rank  Year  Points
4  Kings     3  2014     741
('Kings', 2016)
    Team  Rank  Year  Points
6  Kings     1  2016     756
('Kings', 2017)
    Team  Rank  Year  Points
7  Kings     1  2017     788
('Riders', 2014)
     Team  Rank  Year  Points
0  Riders     1  2014     876
('Riders', 2015)
     Team  Rank  Year  Points
1  Riders     2  2015     789
('Riders', 2016)
     Team  Rank  Year  Points
8  Riders     2  2016     694
('Riders', 2017)
      Team  Rank  Year  Points
11  Riders     2  2017     690
('Royals', 2014)
     Team  Rank  Year  Points
9  Royals     4  2014     701
('Royals', 2015)
      Team  Rank  Year  Points
10  Royals     1  2015     804
('kings', 2015)
    Team  Rank  Year  Points
5  kings     4  2015     812

In [22]:
s2["Points"].sum()

Team    Year
Devils  2014    863
        2015    673
Kings   2014    741
        2016    756
        2017    788
Riders  2014    876
        2015    789
        2016    694
        2017    690
Royals  2014    701
        2015    804
kings   2015    812
Name: Points, dtype: int64

In [35]:
df

      Team  Rank  Year  Points
0   Riders     1  2014     876
1   Riders     2  2015     789
2   Devils     2  2014     863
3   Devils     3  2015     673
4    Kings     3  2014     741
5    kings     4  2015     812
6    Kings     1  2016     756
7    Kings     1  2017     788
8   Riders     2  2016     694
9   Royals     4  2014     701
10  Royals     1  2015     804
11  Riders     2  2017     690

In [36]:
#__sabse highest score nikalo 

df[df.Points==df['Points'].max()]

     Team  Rank  Year  Points
0  Riders     1  2014     876

In [37]:
#__Groupby banya hamne [Year] ka then maximum nikala hamne years wise 

g =df.groupby('Year')
g

In [18]:
import numpy as np

g[["Points","Team"]].agg(np.max)

      Points    Team
Year
2014     876  Royals
2015     812   kings
2016     756  Riders
2017     788  Riders

In [16]:
for i,j in g:
    print(i)
    print(j)

2014
     Team  Rank  Year  Points
0  Riders     1  2014     876
2  Devils     2  2014     863
4   Kings     3  2014     741
9  Royals     4  2014     701
2015
      Team  Rank  Year  Points
1   Riders     2  2015     789
3   Devils     3  2015     673
5    kings     4  2015     812
10  Royals     1  2015     804
2016
     Team  Rank  Year  Points
6   Kings     1  2016     756
8  Riders     2  2016     694
2017
      Team  Rank  Year  Points
7    Kings     1  2017     788
11  Riders     2  2017     690

# _Pivot_Table